Revit 2026 API

# TemporaryGraphicsCommandData Properties

---

The TemporaryGraphicsCommandData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Document | The document. |
|  | Index | The unique index of the temporary graphics object managed by TemporaryGraphicsManager. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

TemporaryGraphicsCommandData Class

Autodesk.Revit.UI Namespace